#301
# -*- coding: utf-8 -*-
# 載入 pandas 模組縮寫為 pd
import ___ as ___

# 資料輸入
datas = [[75, 62, 85, 73, 60], [91, 53, 56, 63, 65],
         [71, 88, 51, 69, 87], [69, 53, 87, 74, 70]]
indexs = ["小林", "小黃", "小陳", "小美"]
columns = ["國語", "數學", "英文", "自然", "社會"]
df = pd.DataFrame(___, columns=___,  index=___)

print('行標題為科目，列題標為個人的所有學生成績')
print(___)
print()

# 輸出後二位學生的所有成績
print('後二位的成績')
print(___)
print()

# 將自然成績做遞減排序輸出
df1 = df.sort_values(by="___", ascending=___)
print('以自然遞減排序')
print(___)
print()

# 僅列小黃的成績，並將其英文成績改為80
df.loc["___", "___"] = 80
print('小黃的成績')
print(___)

#302
# --開始--批改評分使用，請勿變動
set_seed = 123
# --結束--批改評分使用，請勿變動

import numpy as np

x = np.random.RandomState(set_seed).randint(low=5, high=16, size=15)
print('隨機正整數：', ___)

x = x.reshape(___, ___)
print('X矩陣內容：')
print(___)
print('最大：', ___)
print('最小：', ___)
print('總和：', ___)
print('四個角落元素：')
print(x[np.ix_([___, ___], [___, ___])])


#303
# 載入 pandas 模組縮寫為 pd
import ___ as ___

#　建構資料
___ = [[9, 203674, 13.2, 18894],
       [11.7, 180785, 12.3, 54894],
       [10.1, 127802, 14.7, 18563],
       [11.8, 28604, 14.9, 21963],
       [13.2, 600, 13.1, 900],
       [6.9, 38071, 9.6, 3555],
       [12.1, 35660, 10.6, 9005],
       [12, 15000, 13, 12000],
       [11.7, 48770, 9.1, 14370],
       [9.84, 6100, 11.89, 8980]]
___ = ["三重市", "台中市", "台北一", "台北二", "台東市", "板橋區", "高雄市", "嘉義市", "鳳山區", "豐原區"]
___ = ["西瓜價", "西瓜量", "香瓜價", "香瓜量"]

df = pd.___(___, columns=___,  index=___)
print('西瓜與香瓜之拍賣行情價量表')
print(df)
print()  # 使用print分隔


df1 = df.___(by="___", ascending=___)
print('以西瓜價遞減排序')
print(df1['西瓜價'])
print()  # 使用print分隔

# 計算台北一市場西瓜/香瓜價量的行情並輸出
df.___["___"]
print('台北一市場的行情')
print(df.___["___"])
print()  # 使用print分隔

indexs[0] = "三重區"
df.index = ____
____[____] = "洋香瓜價"
____[____] = "洋香瓜量"
df.____ = ____
print('全體市場行情')
print(df)


#304
# 載入 numpy 模組

# 載入 pandas 模組縮


# 讀入 read.csv 檔案


# 判斷資料型態
print('資料型態：%s' % ___(__))
# 計算平均數
print('平均值：%.2f' % __.___(__))
# 計算中位數
print('中位數：%.2f' % __.___(__))
# 計算標準差
print('標準差：%.2f' % __.___(__))
# 計算變異數
print('變異數：%.2f' % __.___(__))
# 計算極差值
print('極差值：%.2f' % __.___(__))


#305
# 載入 pandas 模組縮寫為 pd
import ___ as ___

# 讀取csv檔
df1 = pd.read_csv(___, encoding="utf-8", sep=",", header=0)

# 居住縣市病例人數，並按遞減順序顯示
df_county = df1.groupby("居住縣市")["___"].___
print(df_county.sort_values(___=___))
# 顯示感染病例人數最多的5個國家，並按遞減順序顯示
df_country = df1.groupby("感染國家")["___"].___
print(df_country.sort_values(___=___).___)
# 台北市各區病例人數
df_taipei = df1[df1.居住縣市 == "___"]
print(df_taipei.groupby("居住鄉鎮")["___"].___)
# 台北市最近病例的日期
print("發病日: " + df_taipei.___.___())